tangeai/tirtc-device-qiming/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# WT9932P4C61-TINY uses the ESP32-P4 revision 3.01 profile from the official
# board package, which is qualified for the P4 400 MHz performance mode.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400
# CONFIG_PM_ENABLE is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SPEED=200
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
# CONFIG_SPIRAM_FLASH_LOAD_TO_PSRAM is not set
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=64
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# ESP-Hosted starts its C61/SDIO transport before the IDF main task reserves
# the internal-only pool. Keep enough headroom for that board-owned startup
# allocation while still protecting 160 KiB for later DMA/control traffic.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=163840
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_FREERTOS_HZ=1000
# TiRTC 2.3.0 P4 package ABI/runtime contract.
# CONFIG_FREERTOS_USE_TRACE_FACILITY is not set
# CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS is not set
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# The base Qiming board has no onboard microphone or speaker. Keep AEC out of
# the runtime and link image until an external audio board is defined.
# CONFIG_APP_AUDIO_AEC_ENABLE is not set
CONFIG_APP_AI_CHAT_VIDEO_ENABLE=y
CONFIG_APP_WECHAT_VOIP_LOCAL_VIDEO_ENABLE=y
CONFIG_APP_WECHAT_VOIP_REMOTE_VIDEO_ENABLE=y
# Numeric media profiles live in main/media/media_tuning.h. Downlink decoder
# scheduling lives in main/services/call_video_renderer_config.h.
CONFIG_APP_RTC_H264_DIRECT_HW_ENCODER=y
CONFIG_APP_RTC_H264_RESOURCE_FALLBACK_ENABLE=y
CONFIG_APP_CALL_VIDEO_DIRECT_LCD=y
# CONFIG_APP_RTC_VIDEO_AUTO_ADAPT_ENABLE is not set
# CONFIG_APP_RTC_SDK_VIDEO_ADAPT_ENABLE is not set
# CONFIG_APP_RTC_WAIT_VIDEO_SUBSCRIBE_BEFORE_CAPTURE is not set
# CONFIG_APP_DEVICE_ONLINE_PAUSE_DURING_RTC is not set
CONFIG_APP_TIRTC_QUERY_SEND_BUFFER_USED=y

# CONFIG_ESP32P4_SELECTS_REV_LESS_V3 is not set
CONFIG_ESP32P4_REV_MIN_301=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
# CONFIG_LV_COLOR_16_SWAP is not set
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_CUSTOM_INCLUDE="stdlib.h"
CONFIG_LV_MEM_BUF_MAX_NUM=16
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=30
CONFIG_LV_INDEV_DEF_READ_PERIOD=15
CONFIG_LV_DPI_DEF=130
CONFIG_LV_DRAW_COMPLEX=y
CONFIG_LV_LAYER_SIMPLE_BUF_SIZE=12288
CONFIG_LV_IMG_CACHE_DEF_SIZE=2
CONFIG_LV_USE_ASSERT_NULL=y
CONFIG_LV_USE_ASSERT_MALLOC=y
CONFIG_LV_ASSERT_HANDLER_INCLUDE="assert.h"
CONFIG_LV_USE_USER_DATA=y
CONFIG_LV_ATTRIBUTE_MEM_ALIGN_SIZE=1
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_USE_IMG=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_BTN=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_THEME_DEFAULT=y

# CONFIG_APP_DEBUG_SCREEN_SERVER_ENABLE is not set
CONFIG_APP_MEMORY_WATERLINE_LOG=y
# CONFIG_APP_VERBOSE_RUNTIME_LOGS is not set
# CONFIG_APP_MEDIA_PERIODIC_DIAGNOSTICS is not set
# CONFIG_APP_MEDIA_COMPACT_HEALTH_LOG is not set

# Keep boot output to actionable warnings and errors. Application lifecycle
# logs remain at INFO and are filtered by app_log_policy.
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

CONFIG_CAMERA_SC2336=y
# The Qiming SC2336/ISP path is validated with the 1024x600 RAW8 sensor mode.
# Keep the local esp_cam_sensor 2.3.0 contract explicit across clean builds.
CONFIG_CAMERA_SC2336_MIPI_RAW8_1024X600_30FPS=y
# CONFIG_CAMERA_SC2336_MIPI_RAW8_1280X720_30FPS is not set
CONFIG_CAMERA_SC2336_MIPI_DEFAULT_FMT_RAW8_1024X600_30FPS=y
# CONFIG_CAMERA_SC2336_MIPI_DEFAULT_FMT_RAW8_1280X720_30FPS is not set
CONFIG_ESP_VIDEO_DISABLE_MIPI_CSI_DRIVER_BACKUP_BUFFER=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_APP_H264_PERSISTENT_REF_POOL=y
CONFIG_APP_H264_PERSISTENT_DB_POOL=y

# Qiming wireless link: ESP32-C61 slave over Hosted SDIO.
# CONFIG_ESP_HOST_WIFI_ENABLED is not set
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C61=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C61=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=13
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
# CONFIG_ESP_HOSTED_SDIO_1_BIT_BUS is not set
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=15
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE is not set
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=20
# TiRTC/KCP must preserve control and acknowledgement datagrams during short
# C6 Wi-Fi queue bursts. Use the existing blocking host SDIO queue as
# backpressure instead of ESP-Hosted's synchronous host-side packet dropping.
# CONFIG_ESP_HOSTED_HOST_TO_ESP_WIFI_DATA_THROTTLE is not set
# CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE is not set
# CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM is not set
# Keep the system event loop large enough for Hosted Wi-Fi/MQTT callbacks.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
# Qiming is a mains-powered realtime media product: do not negotiate individual
# target wake time, and do not reserve the unused Hosted command-line task.
# CONFIG_ESP_HOSTED_ENABLE_ITWT is not set
# CONFIG_ESP_HOSTED_CLI_ENABLED is not set
# Use the ESP-Hosted P4+C61 receive profile. These values are sent to the C61
# in esp_wifi_init(), so C6-oriented settings must not be reused here.
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_STATIC_TX_BUFFER=y
CONFIG_WIFI_RMT_STATIC_TX_BUFFER_NUM=16
CONFIG_WIFI_RMT_CACHE_TX_BUFFER_NUM=16
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=16
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=16

# Match the official ESP32-P4 + ESP32-C61 ESP-Hosted socket profile. The tiny
# defaults (TCP/UDP mailbox 6 and 5760-byte TCP windows) are too shallow for
# bursty or higher-RTT networks such as phone hotspots.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y
# Bound out-of-order TCP buffering so Wi-Fi bursts cannot consume PSRAM
# indefinitely while preserving enough reordering tolerance for mobile links.
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
# Runtime Wi-Fi power save is also disabled by wifi.c. These options remove
# disconnected modem sleep and its sleep-only IRAM footprint from the host.
# CONFIG_WIFI_RMT_SLP_IRAM_OPT is not set
# CONFIG_WIFI_RMT_STA_DISCONNECTED_PM_ENABLE is not set
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_ECP_C=y
CONFIG_MBEDTLS_ECDH_C=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_PEM_PARSE_C=y
CONFIG_MBEDTLS_AES_C=y
CONFIG_MBEDTLS_DES_C=y
CONFIG_MBEDTLS_SHA1_C=y
CONFIG_MBEDTLS_USE_CRYPTO_ROM_IMPL=n
CONFIG_MBEDTLS_ROM_MD5=n

CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# CONFIG_ESP_TLS_INSECURE is not set

CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_QRCODE=y

CONFIG_LWIP_SNTP_MAX_SERVERS=4
# CONFIG_LWIP_SNTP_STARTUP_DELAY is not set
CONFIG_MQTT_PROTOCOL_5=y
CONFIG_MQTT_TRANSPORT_SSL=y
# CONFIG_MQTT_TRANSPORT_WEBSOCKET is not set
# CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE is not set

CONFIG_ESP_H264_DECODER_IRAM=y
# CONFIG_ESP_H264_DUAL_TASK is not set
